"""Пита дијаграм е кружна графичка репрезентација на податочно множество,
    каде што секоја фреквенција на класите е претставена со еден дел (кружен
    отсечок), одреден според амплитуда во степени добиени од единечната
    фреквенција на делот наспроти вкупните фреквенции на сите делови.
    Степените на секој дел може да се добијат со следење на следните чекори:

    Пресметајте ја вкупната вредност на фреквенциите.
    Пресметајте го процентот на фреквенцијата на секоја категорија поделен
    со вкупната вредност за фреквенциите.
    Трансформирајте го секој процент во степени помножејќи го за 360.
"""


def pie_chart(map):
    result = {}
    sumValues = sum(map.values())
    for key, value in map.items():
        result[key] = round((value / sumValues) * 360)

    return result


if __name__ == '__main__':
    input1 = {"a": 1, "b": 2}
    input2 = {"a": 30, "b": 15, "c": 55}
    input3 = {"a": 8, "b": 21, "c": 12, "d": 5, "e": 4}

    print(pie_chart(input1))
    print(pie_chart(input2))
    print(pie_chart(input3))